#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

tailscale_tailnet_key.k0s: Refreshing state... [id=k13K1Pcm9P11CNTRL]
data.cloudavenue_tier0_vrfs.t0s: Reading...
data.cloudavenue_catalog_vapp_template.ubuntu: Reading...
cloudavenue_vdc.production: Refreshing state... [id=urn:vcloud:vdc:f555be9c-5f72-4d8a-8dd2-ccf4ebd61ae9]
data.cloudavenue_catalog_vapp_template.ubuntu: Read complete after 2s [id=urn:vcloud:vappTemplate:d5201583-4127-40ea-b479-cbdbffdab944]
cloudavenue_vapp.k0s-cluster: Refreshing state... [id=urn:vcloud:vapp:c7d8403f-077e-4093-abcc-722e71bc5986]
data.cloudavenue_tier0_vrfs.t0s: Read complete after 7s [id="474baabd-09ea-5f2f-ad74-c4a3778fd16e"]
cloudavenue_edgegateway.prod: Refreshing state... [id=urn:vcloud:gateway:f48f561d-d767-4634-82bb-34f986f8b705]
cloudavenue_publicip.k0s: Refreshing state... [id=62.161.18.182]
cloudavenue_network_routed.k0s: Refreshing state... [id=urn:vcloud:network:6e919084-81e1-4450-b1cd-16c36f8416ba]
data.cloudavenue_edgegateway_security_group.k3s: Reading...
cloudavenue_vapp_org_network.k0s-cluster: Refreshing state... [id=urn:vcloud:network:fbb01470-bc92-4ef3-b947-b0b586f52fa0]
cloudavenue_edgegateway_security_group.k0s: Refreshing state... [id=urn:vcloud:firewallGroup:43334184-f115-42b7-87b9-0f12e29015ee]
cloudavenue_edgegateway_nat_rule.out-k0s: Refreshing state... [id=9e9bb0bb-bcf3-4b2e-9933-e37e6116255e]
data.cloudavenue_edgegateway_security_group.k3s: Read complete after 5s [id=urn:vcloud:firewallGroup:3f1cfd62-8278-43be-bc4c-6a865d555410]
cloudavenue_edgegateway_firewall.k0s: Refreshing state... [id=urn:vcloud:gateway:f48f561d-d767-4634-82bb-34f986f8b705]
module.vm-k0s-cluster.random_string.names[2]: Refreshing state... [id=fpna]
module.vm-k0s-cluster.random_string.names[1]: Refreshing state... [id=jchz]
module.vm-k0s-cluster.random_string.names[0]: Refreshing state... [id=sjxy]
module.vm-k0s-cluster.random_string.names[3]: Refreshing state... [id=vgog]
module.vm-k0s-cluster.cloudavenue_vm.k0s[0]: Refreshing state... [id=urn:vcloud:vm:250c347c-c462-4350-95fe-390ca804434b]
module.vm-k0s-cluster.cloudavenue_vm.k0s[1]: Refreshing state... [id=urn:vcloud:vm:879c9844-a237-462e-850b-3faa85095181]
module.vm-k0s-cluster.cloudavenue_vm.k0s[3]: Refreshing state... [id=urn:vcloud:vm:2285a313-b28c-416e-a9cf-3999a5c348ad]
module.vm-k0s-cluster.cloudavenue_vm.k0s[2]: Refreshing state... [id=urn:vcloud:vm:22ac6530-655d-4d5b-8b92-c390d30aa61e]
module.vm-k0s-cluster.data.tailscale_device.k0s[3]: Reading...
module.vm-k0s-cluster.data.tailscale_device.k0s[0]: Reading...
module.vm-k0s-cluster.data.tailscale_device.k0s[2]: Reading...
module.vm-k0s-cluster.data.tailscale_device.k0s[1]: Reading...
module.vm-k0s-cluster.data.tailscale_device.k0s[2]: Read complete after 1s [id=2641880554755322]
module.vm-k0s-cluster.data.tailscale_device.k0s[1]: Read complete after 1s [id=5320587887096926]
module.vm-k0s-cluster.data.tailscale_device.k0s[3]: Read complete after 1s [id=2807663591277732]
module.vm-k0s-cluster.data.tailscale_device.k0s[0]: Read complete after 1s [id=8135355958119118]
module.vm-k0s-cluster.tailscale_device_authorization.k0s[0]: Refreshing state... [id=8135355958119118]
module.vm-k0s-cluster.tailscale_device_key.k0s[0]: Refreshing state... [id=8135355958119118]
module.vm-k0s-cluster.tailscale_device_key.k0s[3]: Refreshing state... [id=2807663591277732]
module.vm-k0s-cluster.tailscale_device_authorization.k0s[3]: Refreshing state... [id=2807663591277732]
module.vm-k0s-cluster.tailscale_device_authorization.k0s[2]: Refreshing state... [id=2641880554755322]
module.vm-k0s-cluster.tailscale_device_key.k0s[2]: Refreshing state... [id=2641880554755322]
module.vm-k0s-cluster.tailscale_device_authorization.k0s[1]: Refreshing state... [id=5320587887096926]
module.vm-k0s-cluster.tailscale_device_key.k0s[1]: Refreshing state... [id=5320587887096926]
local_file.k0sctl-config: Refreshing state... [id=5d2ac38d7e0f91116fdfc166c7814c4ba72dfaea]
null_resource.k0sctl: Refreshing state... [id=7651167446048264093]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.tailscale_devices.k0s-cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tailscale_devices" "k0s-cluster" {
      + devices     = (known after apply)
      + id          = (known after apply)
      + name_prefix = "k0s-cluster"
    }

  # local_file.k0sctl-config must be replaced
-/+ resource "local_file" "k0sctl-config" {
      ~ content              = <<-EOT
            "apiVersion": "k0sctl.k0sproject.io/v1beta1"
            "kind": "Cluster"
            "metadata":
              "name": "k0s-cluster"
              "user": "admin"
            "spec":
              "hosts":
              - "dataDir": "/srv/k0s"
                "noTaints": true
                "role": "controller+worker"
                "ssh":
                  "address": "k0s-cluster-fpna"
                  "keyPath": "~/.ssh/id_rsa"
                  "port": 22
                  "user": "cav"
              - "dataDir": "/srv/k0s"
                "noTaints": true
                "role": "controller+worker"
                "ssh":
                  "address": "k0s-cluster-jchz"
                  "keyPath": "~/.ssh/id_rsa"
                  "port": 22
                  "user": "cav"
              - "dataDir": "/srv/k0s"
                "noTaints": true
                "role": "controller+worker"
                "ssh":
                  "address": "k0s-cluster-sjxy"
                  "keyPath": "~/.ssh/id_rsa"
                  "port": 22
                  "user": "cav"
              - "dataDir": "/srv/k0s"
                "noTaints": true
                "role": "controller+worker"
                "ssh":
                  "address": "k0s-cluster-vgog"
                  "keyPath": "~/.ssh/id_rsa"
                  "port": 22
                  "user": "cav"
              "k0s":
                "config":
                  "apiVersion": "k0s.k0sproject.io/v1beta1"
                  "kind": "Cluster"
                  "metadata":
                    "name": "k0s"
                  "spec":
                    "api":
                      "k0sApiPort": 9443
                      "port": 6443
                    "installConfig":
                      "users":
                        "etcdUser": "etcd"
                        "kineUser": "kube-apiserver"
                        "konnectivityUser": "konnectivity-server"
                        "kubeAPIserverUser": "kube-apiserver"
                        "kubeSchedulerUser": "kube-scheduler"
                    "konnectivity":
                      "adminPort": 8133
                      "agentPort": 8132
                    "network":
                      "kubeProxy":
                        "disabled": false
                        "mode": "iptables"
                      "kuberouter":
                        "autoMTU": true
                        "mtu": 0
                        "peerRouterASNs": ""
                        "peerRouterIPs": ""
                      "podCIDR": "10.244.0.0/16"
                      "provider": "kuberouter"
                      "serviceCIDR": "10.96.0.0/12"
                    "podSecurityPolicy":
                      "defaultPolicy": "00-k0s-privileged"
                    "storage":
                      "type": "etcd"
                    "telemetry":
                      "enabled": true
        EOT -> (known after apply) # forces replacement
      ~ content_base64sha256 = "Q3pqtu7V02OWvm5zRwslgU/HcL5C323dbTUKIUqjHk0=" -> (known after apply)
      ~ content_base64sha512 = "38spzjQ1GHkRm/hirf3eGzj2+W7sSS/M+BQQ4BWj0HdWWJervDIfbDFSL7fiAQU0pQGKiw3lZlf1OThuXp8v3A==" -> (known after apply)
      ~ content_md5          = "20965119894c4be07b87b6e7e9370269" -> (known after apply)
      ~ content_sha1         = "5d2ac38d7e0f91116fdfc166c7814c4ba72dfaea" -> (known after apply)
      ~ content_sha256       = "437a6ab6eed5d36396be6e73470b25814fc770be42df6ddd6d350a214aa31e4d" -> (known after apply)
      ~ content_sha512       = "dfcb29ce34351879119bf862adfdde1b38f6f96eec492fccf81410e015a3d077565897abbc321f6c31522fb7e2010534a5018a8b0de56657f539386e5e9f2fdc" -> (known after apply)
      ~ id                   = "5d2ac38d7e0f91116fdfc166c7814c4ba72dfaea" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # null_resource.k0sctl must be replaced
-/+ resource "null_resource" "k0sctl" {
      ~ id       = "7651167446048264093" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2025-01-13T17:20:26Z" -> "timestamp()"
        }
    }

  # module.vm-k0s-cluster.null_resource.delete_node[0] will be created
  + resource "null_resource" "delete_node" {
      + id       = (known after apply)
      + triggers = {
          + "ip"          = "192.168.111.110"
          + "name"        = "k0s-cluster-sjxy"
          + "private_key" = (sensitive value)
        }
    }

  # module.vm-k0s-cluster.null_resource.delete_node[1] will be created
  + resource "null_resource" "delete_node" {
      + id       = (known after apply)
      + triggers = {
          + "ip"          = "192.168.111.111"
          + "name"        = "k0s-cluster-jchz"
          + "private_key" = (sensitive value)
        }
    }

  # module.vm-k0s-cluster.null_resource.delete_node[2] will be created
  + resource "null_resource" "delete_node" {
      + id       = (known after apply)
      + triggers = {
          + "ip"          = "192.168.111.112"
          + "name"        = "k0s-cluster-fpna"
          + "private_key" = (sensitive value)
        }
    }

  # module.vm-k0s-cluster.null_resource.delete_node[3] will be created
  + resource "null_resource" "delete_node" {
      + id       = (known after apply)
      + triggers = {
          + "ip"          = "192.168.111.113"
          + "name"        = "k0s-cluster-vgog"
          + "private_key" = (sensitive value)
        }
    }

Plan: 6 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dmicheneau, Action: `pull_request`*